In [4]:
import pandas as pd
import numpy as np
dataset = pd.read_csv("sample_missing_values_dataset.csv")
dataset

      Name   Age Gender      City   Salary
0    Alice  25.0      F  New York  50000.0
1      Bob  30.0      M    London  60000.0
2  Charlie   NaN      M       NaN  55000.0
3    David  45.0    NaN     Paris      NaN
4      Eve  22.0      F     Tokyo  48000.0
5    Frank   NaN      M    Berlin  52000.0
6      NaN  34.0      M       NaN  61000.0
7   Hannah  29.0    NaN    Sydney      NaN
8      Ian   NaN      M      Rome  47000.0
9     Jane  40.0      F   Toronto  58000.0

In [5]:
dataset.isnull().sum()

Name      1
Age       3
Gender    2
City      2
Salary    2
dtype: int64

In [16]:
from Univariate import Univariate
quan, qual = Univariate.quanQual(dataset)

from sklearn.impute import SimpleImputer
imp = SimpleImputer(missing_values = np.nan, strategy = 'mean')
imp.fit(dataset[quan])
processedtbl_quan = pd.DataFrame(imp.transform(dataset[quan]), columns = quan)
processedtbl_quan

imp = SimpleImputer(missing_values = np.nan,strategy = 'most_frequent')
imp.fit(dataset[qual])
processedtbl_qual = pd.DataFrame(imp.transform(dataset[qual]), columns = qual)
processedtbl_qual

      Name Gender      City
0    Alice      F  New York
1      Bob      M    London
2  Charlie      M    Berlin
3    David      M     Paris
4      Eve      F     Tokyo
5    Frank      M    Berlin
6    Alice      M    Berlin
7   Hannah      M    Sydney
8      Ian      M      Rome
9     Jane      F   Toronto

#Merge two tables in Pandas

In [19]:
two_tables = [processedtbl_quan,processedtbl_qual]
preProcessed = pd.concat(two_tables, axis = 1)
preProcessed.to_csv("PreProcessedAssignmentData.csv")